## Pandas series and DataFrames
### Series
#### 1.form of sequentially one-dimensional arrays
#### 2.All elements belong to one data type
#### 3.can be created from lists,tuples and arrays

## DataFrame
#### Two dimensional data structure.
#### That can store various types of data

In [1]:
import pandas as pd

In [2]:
## creating series using pandas

pd.Series(["M","F","M","M","F"])

0    M
1    F
2    M
3    M
4    F
dtype: object

In [3]:
import numpy as np

In [4]:
## creating a series usimnmg numpy

pd.Series(np.array(["M","F","M","M","F"]))

0    M
1    F
2    M
3    M
4    F
dtype: object

In [5]:
gen = pd.Series(np.array(["M","F","M","M","F"]))
print(gen)
type(gen)

0    M
1    F
2    M
3    M
4    F
dtype: object

pandas.core.series.Series

In [6]:
dict = {"alpha":1,"beta":2,3:"hello",4:204}
pd.Series(dict)

alpha        1
beta         2
3        hello
4          204
dtype: object

In [7]:
type(dict)

dict

In [8]:
## converting dict in series type

dict = {"alpha":1,"beta":2,3:"hello",4:204}
dict_1 = pd.Series(dict)

In [9]:
type(dict_1)

pandas.core.series.Series

In [10]:
dict_1.index

Index(['alpha', 'beta', 3, 4], dtype='object')

In [11]:
dict_1.values

array([1, 2, 'hello', 204], dtype=object)

In [12]:
list_1 = ["sky",345,1.414,"2023-05-12",True,False]
ser = pd.Series(list_1)

In [13]:
ser.index

RangeIndex(start=0, stop=6, step=1)

##### Examples for DataFrame

In [14]:
df = pd.DataFrame({"Name":["radha","krishna","Adhi"],"Age":[21,24,45],
              "sex":["M","M","F"]})
df

      Name  Age sex
0    radha   21   M
1  krishna   24   M
2     Adhi   45   F

In [15]:
## intrested in only age columns
df["Age"]

0    21
1    24
2    45
Name: Age, dtype: int64

In [16]:
type(df["Age"])

pandas.core.series.Series

In [17]:
df["Age"][1]

24

In [18]:
df.columns

Index(['Name', 'Age', 'sex'], dtype='object')

In [19]:
ser1 = pd.Series(["cricket","hockey","football"],index = [0,1,2])
ser2 = pd.Series(["cricket","hockey","football"],index = [11,12,13])
ser1

0     cricket
1      hockey
2    football
dtype: object

In [20]:
ser2

11     cricket
12      hockey
13    football
dtype: object

In [21]:
ser2 + ser1

0     NaN
1     NaN
2     NaN
11    NaN
12    NaN
13    NaN
dtype: object

In [22]:
ser1 = pd.Series([0,1,2],index = ["cricket","hockey","baseball"])
ser2 = pd.Series([11,12,13],index = ["cricket","hockey","football"])

In [23]:
ser1

cricket     0
hockey      1
baseball    2
dtype: int64

In [24]:
ser2

cricket     11
hockey      12
football    13
dtype: int64

In [25]:
ser2 + ser1

baseball     NaN
cricket     11.0
football     NaN
hockey      13.0
dtype: float64

In [26]:
ser3 = pd.Series([11,12,13],name = "rollno")

In [27]:
plus_10 = lambda x : x+10

In [28]:
plus_10(5)

15

In [29]:
ser3.apply(lambda x : x+10)

0    21
1    22
2    23
Name: rollno, dtype: int64

In [34]:
df = pd.read_csv(r"C:\Users\sivas\Downloads\IRIS.csv")

In [35]:
## we using df.head() without any number in () it will show top five

df.head()

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [36]:
### we using df.tail() without any number in () it will show buttom five

df.tail()

     sepal_length  sepal_width  petal_length  petal_width         species
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

In [37]:
### It will show randomly one of the observations

df.sample()

     sepal_length  sepal_width  petal_length  petal_width         species
145           6.7          3.0           5.2          2.3  Iris-virginica

In [40]:
### To know how many rows and columns

df.shape

(150, 5)

In [42]:
df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [45]:
### want to see data types

df.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [47]:
### to know wether dataset had missing values

df.isnull()

     sepal_length  sepal_width  petal_length  petal_width  species
0           False        False         False        False    False
1           False        False         False        False    False
2           False        False         False        False    False
3           False        False         False        False    False
4           False        False         False        False    False
..            ...          ...           ...          ...      ...
145         False        False         False        False    False
146         False        False         False        False    False
147         False        False         False        False    False
148         False        False         False        False    False
149         False        False         False        False    False

[150 rows x 5 columns]

In [49]:
### conforming we have missing values or not  by doing sum

df.isnull().sum()

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64

In [50]:
type(df)

pandas.core.frame.DataFrame

In [51]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [52]:
## to include categorical data 

df.describe(include = "all")

        sepal_length  sepal_width  petal_length  petal_width      species
count     150.000000   150.000000    150.000000   150.000000          150
unique           NaN          NaN           NaN          NaN            3
top              NaN          NaN           NaN          NaN  Iris-setosa
freq             NaN          NaN           NaN          NaN           50
mean        5.843333     3.054000      3.758667     1.198667          NaN
std         0.828066     0.433594      1.764420     0.763161          NaN
min         4.300000     2.000000      1.000000     0.100000          NaN
25%         5.100000     2.800000      1.600000     0.300000          NaN
50%         5.800000     3.000000      4.350000     1.300000          NaN
75%         6.400000     3.300000      5.100000     1.800000          NaN
max         7.900000     4.400000      6.900000     2.500000          NaN

In [53]:
df.index

RangeIndex(start=0, stop=150, step=1)

In [54]:
## if we want change the column name

df.columns = ["sepal_Length","sepal_width","petal_length",
              "petal_width","species_names"]

In [55]:
df

     sepal_Length  sepal_width  petal_length  petal_width   species_names
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

In [58]:
### if we want to see only specific column
df.sepal_Length

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal_Length, Length: 150, dtype: float64

In [60]:
### want to see multiple columns

df[["sepal_Length","sepal_width"]]

     sepal_Length  sepal_width
0             5.1          3.5
1             4.9          3.0
2             4.7          3.2
3             4.6          3.1
4             5.0          3.6
..            ...          ...
145           6.7          3.0
146           6.3          2.5
147           6.5          3.0
148           6.2          3.4
149           5.9          3.0

[150 rows x 2 columns]

In [61]:
df = pd.DataFrame([["Name","Age","Sex"],["honey",23,"female"],
                ["rose",46,"female"]])

In [62]:
df

       0    1       2
0   Name  Age     Sex
1  honey   23  female
2   rose   46  female

In [65]:
## another way of creating a dataframe

dff = pd.DataFrame([["honey",23,"female"], ["rose",46,"female"]],
                   columns = ["Name","age","sex"])

In [66]:
dff

    Name  age     sex
0  honey   23  female
1   rose   46  female

In [68]:
dff.index = ["name1","name2"]

In [69]:
dff

        Name  age     sex
name1  honey   23  female
name2   rose   46  female

In [71]:
dff.index

Index(['name1', 'name2'], dtype='object')

In [76]:
### to change row name

dff.rename(index={"name1":"name_1"},inplace = True)

In [77]:
dff

         Name  age     sex
name_1  honey   23  female
name2    rose   46  female

In [108]:
### creating another dataframe

scores = {"math":[45,56,67,45,67],"social":[34,45,67,78,93],
          "env":[47,67,87,89,56]}

In [109]:
scores

{'math': [45, 56, 67, 45, 67],
 'social': [34, 45, 67, 78, 93],
 'env': [47, 67, 87, 89, 56]}

In [110]:
df = pd.DataFrame(scores,index = ["name1","name2","name3","name4","name5"])

In [111]:
df1 = df[:]

In [107]:
## to avoid reapperance we use inplace = True

df1.drop("name1",inplace = True)

C:\Users\sivas\AppData\Local\Temp\ipykernel_3768\1912051859.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1.drop("name1",inplace = True)

In [112]:
df1

       math  social  env
name1    45      34   47
name2    56      45   67
name3    67      67   87
name4    45      78   89
name5    67      93   56

In [93]:
## to drop a column we have write axis = 1 otherwise it shows and error
df1.drop("math",axis = 1)

       social  env
name2      45   67
name3      67   87
name4      78   89
name5      93   56

In [97]:
### want to drop multiple columns
df1.drop(["math","social"],axis = 1,inplace = True)

C:\Users\sivas\AppData\Local\Temp\ipykernel_3768\1085714061.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1.drop(["math","social"],axis = 1,inplace = True)

In [98]:
df1

       env
name1   47
name2   67
name3   87
name4   89
name5   56

In [99]:
df

       math  social  env
name1    45      34   47
name2    56      45   67
name3    67      67   87
name4    45      78   89
name5    67      93   56

In [100]:
df.loc["name3"]

math      67
social    67
env       87
Name: name3, dtype: int64

In [101]:
df.set_index("math",inplace = True)

In [102]:
df

      social  env
math
45        34   47
56        45   67
67        67   87
45        78   89
67        93   56

In [113]:
df1.iloc[0,1:]

social    34
env       47
Name: name1, dtype: int64

In [114]:
df.iloc[[0,1],[1,2]]

       social  env
name1      34   47
name2      45   67

In [115]:
df["lan"] = 80

In [116]:
df

       math  social  env  lan
name1    45      34   47   80
name2    56      45   67   80
name3    67      67   87   80
name4    45      78   89   80
name5    67      93   56   80

In [117]:
df.loc[5] = [24,45,67,87]
df

       math  social  env  lan
name1    45      34   47   80
name2    56      45   67   80
name3    67      67   87   80
name4    45      78   89   80
name5    67      93   56   80
5        24      45   67   87